In [2]:
import pandas as pd 

df = pd.read_csv("outlier_ornek_veriseti.csv",sep=';')#ayırma için ; kullandık default olarak , vardır.
df

      isim  boy
0      can   88
1      ali  132
2    tugce  134
3     ayse  137
4    nihan  139
5    sahin  142
6     kaan  142
7     emre  144
8    bartu  147
9   ismail  148
10  gokalp  149
11   osman  149
12   filiz  150
13    veli  207
14   ilker  234

In [3]:
df.describe()

              boy
count   15.000000
mean   149.466667
std     32.943386
min     88.000000
25%    138.000000
50%    144.000000
75%    149.000000
max    234.000000

 ## Q1(%25 percentile Hesaplama)

In [4]:
Q1 = df.boy.quantile(0.25)
Q1

138.0

## Q3(%75 percentile Hesaplama)

In [7]:
Q3 = df.boy.quantile(0.75)
Q3

149.0

In [6]:
IQR_degeri = Q3-Q1
IQR_degeri

11.0

## Alt Limit ve Üst Limit Hesaplama

In [9]:
alt_limit = Q1 - 1.5*IQR_degeri

In [10]:
alt_limit

121.5

In [11]:
ust_limit = Q3 + 1.5 * IQR_degeri
ust_limit

165.5

In [12]:
df[(df.boy<alt_limit) | (df.boy > ust_limit)]

     isim  boy
0     can   88
13   veli  207
14  ilker  234

## Outlier Degerlerinin veristimizden cıkarılması

In [13]:
df_outlier_filtrelenmis = df[(df.boy > alt_limit) & (df.boy < ust_limit)]

In [14]:
df_outlier_filtrelenmis

      isim  boy
1      ali  132
2    tugce  134
3     ayse  137
4    nihan  139
5    sahin  142
6     kaan  142
7     emre  144
8    bartu  147
9   ismail  148
10  gokalp  149
11   osman  149
12   filiz  150

In [16]:
df = df_outlier_filtrelenmis

In [17]:
df

      isim  boy
1      ali  132
2    tugce  134
3     ayse  137
4    nihan  139
5    sahin  142
6     kaan  142
7     emre  144
8    bartu  147
9   ismail  148
10  gokalp  149
11   osman  149
12   filiz  150